//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameTitle.cpp
//!
//! @brief  タイトル処理のソースファイル
//!
//! @date   日付		
//!
//! @author 制作者名	
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み ================================================
#include "GameMain.h"
#include "PBullet.h"

#include <d3d11.h>
#include <SimpleMath.h>

using namespace DirectX::SimpleMath;
using namespace DirectX;

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
PBullet::PBullet()
{

}

//----------------------------------------------------------------------
//! @brief デストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
PBullet::~PBullet()
{

}

//----------------------------------------------------------------------
//! @brief タイトル処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void PBullet::Create()
{
	if (g_init == 0)
	{
		g_init = 1;

		g_TimeCnt = 0;

		//ADX2Le::Play(CRI_CUESHEET_0_NC86372);

	}

	//g_TimeCnt++;
	//if (g_TimeCnt > 180)
	if (g_keyTracker->pressed.Space)
	{
		g_NextScene = PLAY;
	}

}

//----------------------------------------------------------------------
//! @brief タイトル描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void PBullet::Delete()
{
	swprintf_s(buf, L"Title");
	g_spriteFont->DrawString(g_spriteBatch.get(), buf, Vector2(0, 20));
}